<template>
  <view p-28rpx text-black>
    <view text-48rpx> 荟聚通用户协议与隐私政策</view>

    <view text-36rpx>特别提示</view>

    <view class="title"
      >广州金灿腾辉软件技术有限责任公司在此特别提醒您（用户）在使用公司旗下小程序相关功能前，请认真阅读本《用户协议》（以下简称“协议”)，确保您充分理解本协议中各条款。<br />请您审慎阅读并选择接受或不接受本协议。除非您接受本协议所有条款，否则您无权使用本协议所涉服务。您在使用本公司旗下小程序相关功能等行为将视为对本协议的接受，并同意接受本协议各项条款的约束。本协议约定广州金灿腾辉软件技术有限责任公司与用户之间关于“荟聚通”小程序服务（以下简称“服务”）的权利义务。“用户”是指使用该小程序服务的个人或集体。<br />本协议可由广州金灿腾辉软件技术有限责任公司随时更新，更新后的协议条款一旦公布即代替原来的协议条款，恕不再另行通知，用户可通过新公开发布的相关协议链接查阅最新版协议条款。在广州金灿腾辉软件技术有限责任公司修改协议条款后，如果用户不接受修改后的条款，需立即停止使用广州金灿腾辉软件技术有限责任公司提供的服务，用户继续使用广州金灿腾辉软件技术有限责任公司提供的服务将被视为接受修改后的协议。</view
    >

    <view text-34rpx>一、帐号注册</view>

    <view class="title"
      >1、用户在使用本服务前需要先在微信注册登录“荟聚通”小程序。广州金灿腾辉软件技术有限责任公司可以根据用户需求或产品需要对使用服务的方式进行变更，而无须事先通知用户。
      2、鉴于微信小程序的相关机制，您同意广州金灿腾辉软件技术有限责任公司在微信平台的相关协议框架许可及《用户隐私保护指引》下获取用户信息（如用户注册登录以及用户使用基于“荟聚通”小程序的交互等）
      3、在用户使用本服务时，广州金灿腾辉软件技术有限责任公司需要搜集能识别用户身份的个人信息以便广州金灿腾辉软件技术有限责任公司可以在必要时联系用户，或者为用户提供更好的使用体验。广州金灿腾辉软件技术有限责任公司搜集的信息为包括但不限于基于微信平台的相关协议框架许可及《用户隐私保护指引》下的信息；广州金灿腾辉软件技术有限责任公司同意对这些信息的使用将受限于第三条用户个人隐私信息保护的约束。
    </view>

    <view text-34rpx>二、服务内容</view>

    <view class="title"
      >本服务的具体内容由广州金灿腾辉软件技术有限责任公司根据实际情况提供，包括但不限于授权用户使用“荟聚通”小程序的相关功能及服务。广州金灿腾辉软件技术有限责任公司可以对其提供的服务予以变更，且广州金灿腾辉软件技术有限责任公司提供的服务内容可能随时变更；用户将会收到广州金灿腾辉软件技术有限责任公司关于服务变更的通知。</view
    >

    <view text-34rpx>三、用户个人信息保护</view>

    <view class="title"
      >1、用户在使用本服务的过程中，可能需要填写或提交一些必要的个人信息，如法律法规、规章规范性文件（以下称“法律法规”）规定的需要填写的身份信息。如用户提交的信息不完整或不符合法律法规的规定，则用户可能无法使用本服务或在使用本服务的过程中受到限制。
      2、尊重用户个人信息的私有性是广州金灿腾辉软件技术有限责任公司的一贯制度，广州金灿腾辉软件技术有限责任公司将采取技术措施和其他必要措施，确保用户个人信息安全，防止在本服务中收集的用户个人信息泄露、毁损或丢失。在发生前述情形或者广州金灿腾辉软件技术有限责任公司发现存在发生前述情形的可能时，广州金灿腾辉软件技术有限责任公司将及时采取补救措施并告知用户，用户如发现存在前述情形亦需立即与广州金灿腾辉软件技术有限责任公司联系。
      3、用户个人信息的定义请参照微信服务框架下关于用户个人信息的相关解释。
      其中个人隐私信息是指涉及用户个人身份或个人隐私的信息，比如，用户真实姓名、身份证号、手机号码、手机设备识别码、IP地址、用户聊天记录。非个人隐私信息是指用户对本服务的操作状态以及使用习惯等明确且客观反映在广州金灿腾辉软件技术有限责任公司服务器端的基本记录信息、个人隐私信息范围外的其它普通信息，以及用户同意公开的上述隐私信息。广州金灿腾辉软件技术有限责任公司保证在取得用户书面同意的情况下收集、使用或公开用户的个人隐私信息，用户同意广州金灿腾辉软件技术有限责任公司无需获得用户的另行确认与授权即可收集、使用或公开用户的非个人隐私信息。
      4、广州金灿腾辉软件技术有限责任公司未经用户同意不向任何第三方公开、透露用户个人隐私信息。但以下特定情形除外：</view
    >

    <view class="detail"
      >(1）广州金灿腾辉软件技术有限责任公司根据法律法规规定或有权机关的指示提供用户的个人隐私信息；
      (2）由于用户个人原因而导致的任何个人信息的泄漏，或其他非因广州金灿腾辉软件技术有限责任公司原因导致的个人隐私信息的泄露；
      (3）用户自行向第三方公开其个人隐私信息；
      (4）用户与广州金灿腾辉软件技术有限责任公司及合作单位之间就用户个人隐私信息的使用公开达成约定，广州金灿腾辉软件技术有限责任公司因此向合作单位公开用户个人隐私信息；
      (5）任何由于黑客攻击、电脑病毒侵入及其他不可抗力事件导致用户个人隐私信息的泄露；
      (6）用户个人信息已经经过处理无法识别特定个人且不能复原。</view
    >

    <view class="title"
      >5、用户同意广州金灿腾辉软件技术有限责任公司可在以下事项中使用用户的个人隐私信息：</view
    >

    <view class="detail"
      >(1）广州金灿腾辉软件技术有限责任公司向用户及时发送重要通知，如服务内容更新、本协议条款的变更；
      (2）广州金灿腾辉软件技术有限责任公司内部进行审计、数据分析和研究等，以改进广州金灿腾辉软件技术有限责任公司的产品、服务和与用户之间的沟通；
      (3）依本协议约定，广州金灿腾辉软件技术有限责任公司管理、审查用户信息及进行处理措施；
      (4）适用法律法规规定的其他事项。除上述事项外，如未取得用户事先同意，广州金灿腾辉软件技术有限责任公司不会将用户个人隐私信息使用于任何其他用途。</view
    >

    <view class="title"
      >6、广州金灿腾辉软件技术有限责任公司重视对未成年人个人信息的保护。任何18岁以下的未成年人身份信息除非经过监护人的书面同意。除根据法律法规的规定及有权机关的指示披露外，广州金灿腾辉软件技术有限责任公司不会使用或向任何第三方透露未成年人的聊天记录及其他个人信息。除本协议约定的例外情形外，未经监护人事先同意，广州金灿腾辉软件技术有限责任公司不会使用或向任何第三方透露未成年人的个人信息。
      7、为了改善广州金灿腾辉软件技术有限责任公司的技术和服务，向用户提供更好的服务体验，广州金灿腾辉软件技术有限责任公司或可会自行收集使用或向第三方提供用户的非个人隐私信息。
      8、广州金灿腾辉软件技术有限责任公司保证在合法、正当与必要的原则下收集、使用或者公开用户个人信息且不会收集与提供的服务无关的用户个人信息。
    </view>

    <view text-34rpx>四、内容规范</view>

    <view class="title"
      >1、本条所述内容是指用户使用本服务过程中所制作、上载、复制、发布、传播的任何内容，包括但不限于帐号头像、名称、用户说明等注册信息及认证资料，或文字、语音、图片、视频、图文等发送、回复或自动回复消息和相关链接页面，以及其他使用帐号或本服务所产生的内容。
      2、用户不得利用、通过“荟聚通”小程序及相关服务制作、上载、复制、发布、传播如下法律、法规和政策禁止的内容：</view
    >

    <view class="detail"
      >(1）反对宪法所确定的基本原则的；
      (2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
      (3）损害国家荣誉和利益的； (4）煽动民族仇恨、民族歧视，破坏民族团结的；
      (5）破坏国家宗教政策，宣扬邪教和封建迷信；
      (6）散布谣言，扰乱社会秩序，破坏社会稳定的；
      (7）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；
      (8）侮辱或者诽谤他人，侵害他人合法权益的；
      (9）不遵守法律法规底线、社会主义制度底线、国家利益底线、公民合法权益底线、社会公共秩序底线、道德风尚底线和信息真实性底线的“七条底线”要求的；
      (10）含有法律、行政法规禁止的其他内容的信息。</view
    >

    <view class="title"
      >3、用户不得利用、通过“荟聚通”小程序或本服务制作、上载、复制、发布、传播如下干扰“荟聚通”正常运营，以及侵犯其他用户或第三方合法权益的内容：</view
    >

    <view class="detail"
      >(1）含有任何性或性暗示的； (2）含有辱骂、恐吓、威胁内容的；
      (3）含有骚扰、垃圾广告、恶意信息、诱骗信息的；
      (4）涉及他人隐私、个人信息或资料的；
      (5）侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的；
      (6）含有其他干扰本服务正常运营和侵犯其他用户或第三方合法权益内容的信息。
    </view>

    <view text-34rpx> 五、使用规则</view>
    <view class="title"
      >1、用户在本服务中或通过本服务所传送、发布的任何内容并不反映或代表，也不得被视为反映或代表广州金灿腾辉软件技术有限责任公司的观点、立场或政策，广州金灿腾辉软件技术有限责任公司对此不承担任何责任。
      2、用户不得利用“荟聚通”小程序及相关服务进行如下行为：</view
    >
    <view class="detail">
      (1）提交、发布虚假信息，或盗用他人头像或资料，冒充、利用他人名义的；
      (2）强制、诱导其他用户关注、点击链接页面或分享信息的；
      (3）虚构事实、隐瞒真相以误导、欺骗他人的；
      (4）利用技术手段批量建立虚假帐号的；
      (5）利用“荟聚通”帐号或本服务从事任何违法犯罪活动的；
      (6）制作、发布与以上行为相关的方法、工具，或对此类方法、工具进行运营或传播，无论这些行为是否为商业目的；
      (7）其他违反法律法规规定、侵犯其他用户合法权益、干扰“荟聚通”正常运营或广州金灿腾辉软件技术有限责任公司未明示授权的行为。</view
    >
    <view class="title">
      3、用户须对利用“荟聚通”帐号或本服务传送信息的真实性、合法性、无害性、准确性、有效性等全权负责，与用户所传播的信息相关的任何法律责任由用户自行承担，与广州金灿腾辉软件技术有限责任公司无关。如因此给广州金灿腾辉软件技术有限责任公司或第三方造成损害的，用户应当依法予以赔偿。
      4、广州金灿腾辉软件技术有限责任公司提供的服务中可能包括广告，用户同意在使用过程中显示广州金灿腾辉软件技术有限责任公司和第三方供应商、合作伙伴提供的广告。除法律法规明确规定外，用户应自行对依该广告信息进行的交易负责，对用户因依该广告信息进行的交易或前述广告商提供的内容而遭受的损失或损害，广州金灿腾辉软件技术有限责任公司不承担任何责任。
      5、除非广州金灿腾辉软件技术有限责任公司书面许可，用户不得从事下列任一行为：</view
    >
    <view class="detail"
      >(1）删除软件及其副本上关于著作权的信息；
      (2）对软件进行反向工程、反向汇编、反向编译，或者以其他方式尝试发现软件的源代码；
      (3）对广州金灿腾辉软件技术有限责任公司拥有知识产权的内容进行使用、出租、出借、复制、修改、链接、转载、汇编、发表、出版、建立镜像站点等；
      (4）对软件或者软件运行过程中释放到任何终端内存中的数据、软件运行过程中客户端与服务器端的交互数据，以及软件运行所必需的系统数据，进行复制、修改、增加、删除、挂接运行或创作任何衍生作品，形式包括但不限于使用插件、外挂或非经广州金灿腾辉软件技术有限责任公司授权的第三方工具／服务接入软件和相关系统；
      (5）通过修改或伪造软件运行中的指令、数据，增加、删减、变动软件的功能或运行效果，或者将用于上述用途的软件、方法进行运营或向公众传播，无论这些行为是否为商目的；
      (6）通过非广州金灿腾辉软件技术有限责任公司开发、授权的第三方软件、插件、外挂、系统，登录或使用广州金灿腾辉软件技术有限责任公司软件及服务，或制作、发布、传播非广州金灿腾辉软件技术有限责任公司开发、授权的第三方软件、插件、外挂、系统。</view
    >
    <view class="title">
      6、用户有责任妥善保管注册帐号信息及帐号密码的安全，因用户保管不善可能导致遭受盗号或密码失窃，责任由用户自行承担。用户需要对注册帐号以及密码下的行为承担法律责任。用户同意在任何情况下不使用其他用户的帐号或密码。在用户怀疑他人使用其帐号或密码时，用户同意立即通知。
      7、用户应遵守本协议的各项条款，正确、适当地使用本服务，如因用户违反本协议中的任何条款，广州金灿腾辉软件技术有限责任公司在通知用户后有权依据协议中断或终止对违约用户的微信帐号提供服务。同时，广州金灿腾辉软件技术有限责任公司保留在任何时候收回“荟聚通”小程序提供服务的权利。</view
    >
    <view text-34rpx> 六、风险承担</view>
    <view class="title">
      1、用户理解并同意，“荟聚通”仅为用户提供信息分享、传送及获取的平台，用户必须为自己所属帐号在“荟聚通”小程序的一切行为负责，包括用户所传送的任何内容以及由此产生的任何后果。用户应对“荟聚通”小程序及相关服务中的内容自行加以判断，并承担因使用内容而引起的所有风险，包括因对内容的正确性、完整性或实用性的依赖而产生的风险。广州金灿腾辉软件技术有限责任公司无法且不会对因用户行为而导致的任何损失或损害承担责任。如果用户发现任何人违反本协议约定或以其他不当的方式使用本服务，请立即向广州金灿腾辉软件技术有限责任公司举报或投诉，广州金灿腾辉软件技术有限责任公司将依本协议约定进行处理。
      2、用户理解并同意，因业务发展需要，广州金灿腾辉软件技术有限责任公司保留单方面对本服务的全部或部分服务内容变更、暂停、终止或撤销的权利，用户需承担此风险。</view
    >
    <view text-34rpx> 七、法律责任</view>
    <view class="title">
      1、如果广州金灿腾辉软件技术有限责任公司发现或收到他人举报或投诉用户违反本协议约定的，广州金灿腾辉软件技术有限责任公司有权不经通知随时对相关内容，包括但不限于用户资料、聊天记录进行审查、举报，并视情节轻重对违规帐号处以包括但不限于警告、功能封禁、移交相关部门处理的处罚，且视情况通知用户处理结果。
      2、用户理解并同意，因用户违反本协议约定，导致或产生的任何第三方主张的任何索赔、要求或损失，包括合理的律师费，用户应当赔偿广州金灿腾辉软件技术有限责任公司与合作公司、关联公司，并使之免受损害。
      3、用户理解并同意，广州金灿腾辉软件技术有限责任公司有权依合理判断对违反有关法律法规或本协议规定的行为进行处罚，对违法违规的任何用户采取适当的法律行动，并依据法律法规保存有关信息向有关部门报告等，用户应承担由此而产生的一切法律责任。</view
    >
    <view text-34rpx>八、不可抗力及其他免责事由</view>
    <view class="title">
      1、用户理解并确认，在使用本服务的过程中，可能会遇到不可抗力等风险因素，使本服务发生中断。不可抗力是指不能预见、不能克服并不能避免且对一方或双方造成重大影响的客观事件，包括但不限于自然灾害如洪水、地震、瘟疫流行和风暴等以及社会事件如战争、动乱、政府行为等。出现上述情况时，广州金灿腾辉软件技术有限责任公司将努力在第一时间与相关单位配合，及时进行修复，但是由此给用户或第三方造成的损失，广州金灿腾辉软件技术有限责任公司及合作单位在法律允许的范围内免责。
      2、用户理解并确认，本服务存在因不可抗力、计算机病毒或黑客攻击、系统不稳定、用户所在位置、用户关机以及其他任何技术、互联网络、通信线路原因等造成的服务中断或不能满足用户要求的风险，因此导致的用户或第三方任何损失，广州金灿腾辉软件技术有限责任公司不承担任何责任。
      3、本服务同大多数互联网服务一样，受包括但不限于用户原因、网络服务质量、社会环境等因素的差异影响，可能受到各种安全问题的侵扰，如他人利用用户的资料，造成现实生活中的骚扰；用户下载安装的其它软件或访问的其他网站中含有“特洛伊木马”等病毒，威胁到用户的计算机信息和数据的安全，继而影响本服务的正常使用等等。用户应加强信息安全及使用者资料的保护意识，要注意加强密码保护，以免遭致损失和骚扰。
      4、用户理解并确认，在使用本服务过程中存在来自任何他人的包括误导性的、欺骗性的、威胁性的、诽谤性的、令人反感的或非法的信息，或侵犯他人权利的匿名或冒名的信息，以
      及伴随该等信息的行为，因此导致的用户或第三方的任何损失，广州金灿腾辉软件技术有限责任公司不承担任何责任。
      5、广州金灿腾辉软件技术有限责任公司依据法律法规、本协议约定获得处理违法违规或违约内容的权利，该权利不构成广州金灿腾辉软件技术有限责任公司的义务或承诺，广州金灿腾辉软件技术有限责任公司不能保证及时发现违法违规或违约行为或进行相应处理。
      6、用户理解并确认，广州金灿腾辉软件技术有限责任公司需要定期或不定期地对“荟聚通”小程序平台或相关的设备进行检修或者维护，如因此类情况而造成服务在合理时间内的中断，广州金灿腾辉软件技术有限责任公司无需为此此承担任何责任，但广州金灿腾辉软件技术有限责任公司应事先进行通告。
      7、用户理解并确认，对于广州金灿腾辉软件技术有限责任公司向用户提供的下列产品或者服务的质量缺陷及其引发的任何损失，广州金灿腾辉软件技术有限责任公司无需承担任何责任：</view
    >
    <view class="detail"
      >(1）广州金灿腾辉软件技术有限责任公司向用户免费提供的服务；
      (2）广州金灿腾辉软件技术有限责任公司向用户赠送的任何产品或者服务。</view
    >
    <view class="title">
      8、在任何情况下，广州金灿腾辉软件技术有限责任公司均不对任何间接性、后果性、惩罚性、偶然性、特殊性或刑罚性的损害，包括因用户使用“荟聚通”或本服务而遭受的利润损失，承担责任（即使广州金灿腾辉软件技术有限责任公司已被告知该等损失的可能性亦然）。尽管本协议中可能含有相悖的规定，广州金灿腾辉软件技术有限责任公司对用户承担的全部责任，无论因何原因或何种行为方式，始终不超过用户因使用广州金灿腾辉软件技术有限责任公司提供的服务而支付给广州金灿腾辉软件技术有限责任公司的费用（如有）。</view
    >
    <view text-34rpx>九、服务的变更、中断、终止</view>
    <view class="title">
      1、鉴于网络服务的特殊性，用户同意广州金灿腾辉软件技术有限责任公司有权随时变更、中断或终止部分或全部的服务（包括收费服务）。广州金灿腾辉软件技术有限责任公司变更、中断或终止的服务，广州金灿腾辉软件技术有限责任公司应当在变更、中断或终止之前通知用户，并应向受影响的用户提供等值的替代性的服务。
      2、如发生下列任何一种情形，广州金灿腾辉软件技术有限责任公司有权变更、中断或终止向用户提供的免费服务或收费服务，而无需对用户或任何第三方承担任何责任：</view
    >
    <view class="detail">
      (1）根据法律规定用户应提交真实信息，而用户提供的个人资料不真实、或与注册时信息不致又未能提供合理证明；
      (2）用户违反相关法律法规或本协议的约定；
      (3）按照法律规定或有权机关的要求；
      (4）出于安全的原因或其他必要的情形。</view
    >
    <view text-34rpx>十、其他</view>
    <view class="title">
      1、广州金灿腾辉软件技术有限责任公司郑重提醒用户注意本协议中免除广州金灿腾辉软件技术有限责任公司责任和限制用户权利的条款，请用户仔细阅读，自主考虑风险。未成年人应在法定监护人的陪同下阅读本协议。
      2、本协议的效力、解释及纠纷的解决，适用于中华人民共和国法律。若用户和广州金灿腾辉软件技术有限责任公司之间发生任何纠纷或争议，首先应友好协商解决，协商不成的，用户同意将纠纷或争议提交广州金灿腾辉软件技术有限责任公司住所地有管辖权的人民法院管辖。
      3、本协议的任何条款无论因何种原因无效或不具可执行性，其余条款仍有效，对双方具有约束力。</view
    >
  </view>
</template>
<script setup lang="ts"></script>

<style scoped>
.detail {
  color: #9b9c9c;
  margin-bottom: 24rpx;
}
.title {
  font-size: 30rpx;
  margin-bottom: 24rpx;
  color: #23282e;
}
</style>
